from aiogram.utils.markdown import hlink


API_KEY = '7484889849:AAFACB55Yh6LYTM8hLlvWY-pA53CNu7xlw8'

SQWER_SHOP_NAME = 'SQWER SHOP'
SQWER_SHOP_URL = 'https://t.me/sqwer_shop'
HLINK = hlink(SQWER_SHOP_NAME, SQWER_SHOP_URL)

WELCOME_MESSAGE = (f'Привіт тебе вітає телеграм бот {HLINK},\n'
                   'За допомогою мене ти можеш швидко та зручно знайти потрібний товар.')

ORDER_3_7_DAYS = 'Замовлення 3-7 днів✈️'
ORDER_12_15_DAYS = 'Замовлення 12-15 днів ✈️'
SPECIAL_OFFERS = 'Спеціальні пропозиції🔥'
FEEDBACK = 'Зворотній зв`язок📞'

WELCOME_BUTTONS = (
    ORDER_3_7_DAYS,
    ORDER_12_15_DAYS,
    SPECIAL_OFFERS,
    FEEDBACK,
)

NUMBERS = 'Залиште ваш номер телефону і в найблищий час ми з вами зв`яжемось.'
ANSWER_FOR_CALL_REQUEST = 'Дякуємо за запит. Скоро ми з вами зв`яжемось.'

MANE_MENU = 'Перейти на головне меню'

BACK = 'Повернутися назад🔙'
USE_NUMBER_BELOW = 'Для того щоб отримати запит скористайтеся кнопкою знизу👇'
